# 🕉️ सूत्र आभासी यन्त्र

import सूत्र_सीपीयू_तंत्र as cpu
import सूत्र_स्मृति_तंत्र as स्मृति
import सूत्र_सञ्चिका_तंत्र as सञ्चिका


class सूत्रआभासीयन्त्र:


    def __init__(self):

        print("🕉️ सूत्र आभासी यन्त्र सक्रिय")


        self.cpu = cpu.सूत्रसीपीयू()

        self.स्मृति = स्मृति.सूत्रस्मृति()

        self.disk = सञ्चिका.सूत्रसञ्चिका()


    def परीक्षण(self):

        print("आभासी यन्त्र परीक्षण प्रारम्भ")


        self.cpu.स्थापय("अ",10)

        self.cpu.स्थापय("ब",20)

        self.cpu.योग("अ","ब")

        self.cpu.दर्शय()


        self.स्मृति.लेखन(100,999)

        self.स्मृति.पठन(100)


        self.disk.निर्माण("test")

        self.disk.लेखन("test","नमस्ते")

        print(self.disk.पठन("test"))


        print("आभासी यन्त्र परीक्षण पूर्ण")
