# 🕉️ सूत्र पूर्ण व्याख्याकार


import सूत्र_आदेश_विश्लेषक as विश्लेषक


class व्याख्याकार:


    def __init__(self):

        self.विश्लेषक = विश्लेषक.आदेशविश्लेषक()

        print("🕉️ सूत्र व्याख्याकार सक्रिय")


    def संचिका_चलाओ(self, संचिका):

        print(f"संचिका लोड: {संचिका}")


        with open(संचिका, "r", encoding="utf-8") as file:

            for पंक्ति in file:

                पंक्ति = पंक्ति.strip()

                if पंक्ति == "":

                    continue

                print("निष्पादन:", पंक्ति)

                self.विश्लेषक.चलाओ(पंक्ति)
