# 🕉️ सूत्र अनुसूचक तंत्र


import time


class अनुसूचक:


    def __init__(self):

        self.प्रक्रियासूची = []
        self.वर्तमान = None

        print("🕉️ सूत्र अनुसूचक सक्रिय")


    def प्रक्रिया_जोड़ो(self, प्रक्रिया):

        self.प्रक्रियासूची.append(प्रक्रिया)

        print(f"अनुसूचक में जोड़ा गया: {प्रक्रिया.नाम}")


    def चलाओ(self):

        print("अनुसूचन प्रारम्भ")

        for प्रक्रिया in self.प्रक्रियासूची:

            self.वर्तमान = प्रक्रिया

            print(f"CPU → {प्रक्रिया.नाम}")

            प्रक्रिया.प्रारम्भ()

            time.sleep(1)

        print("अनुसूचन समाप्त")
